/*ЗАДАНИЕ 1
Задайте массив заполненный случайными положительными трехзначными числами. Напишите  программу которая покажет количество
четных чисел в массиве
Пример:
[345,897,568,234] = 2
*/
// Console.Write("Введите размер массива: ");
// int size = Convert.ToInt32(Console.ReadLine());
// int [] num = new int [size];
// int count = 0;
// ArrayRandom(num);
// PrintArray(num);

// for (int i = 0; i < num.Length; i++)
// {
//     if(num[i] % 2 == 0)
//     count++;
// }

// void ArrayRandom(int[] array)
// {
//     for (int i = 0; i < array.Length; i++)
//         array[i] = new Random().Next(100,1000);
// }

// void PrintArray( int[] array)
// {
//     for(int i = 0; i < array.Length; i++)
//     {
//         Console.Write(array[i] + " ");
//     }
//     Console.WriteLine();
// }

// Console.WriteLine($"В массиве {count} четных чисел");

/*ЗАДАНИЕ 2
Задайте одномерный массив, заполненный случайными числами.Найдите сумму элементов стоящих на нечетных позициях.
Пример:
[3,7,23,12] = 19
[-4,-6,86,6] = 0
*/



/*ЗАДАНИЕ 3
Задайте массив вещественных чисел.Найдите разницу между максимальным и минимальным значением элементов массива
Пример:
[3,7,22,2,78] = 76
*/